app/views/players/show.html.erb

<div class="col-md-8">
	<% if @player.stats.any? %>
---
SELECT  1 AS one FROM "stats" WHERE "stats"."player_id" = ? LIMIT 1  [["player_id", 1]]
SELECT "stats".* FROM "stats" WHERE "stats"."player_id" = ?  [["player_id", 1]]