app/controllers/players_controller.rb

  def show
    @player = Player.find(params[:id])
    @stats = @player.stats.paginate(page: params[:page])
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 0]]
SELECT  "stats".* FROM "stats" WHERE "stats"."player_id" = ? LIMIT 30 OFFSET 0  [["player_id", 1]]
SELECT COUNT(*) FROM "stats" WHERE "stats"."player_id" = ?  [["player_id", 1]]

  def index
    @players = Player.paginate(page: params[:page])
---
SELECT  "players".* FROM "players" LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM "players"

  def create
    @player = Player.new(player_params)
    if @player.save
---
INSERT INTO "players" ("rank", "rating", "playername", "server", "race", "gender", "classchoice", "faction", "seasonwins", "seasonlosses", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @player = Player.find(params[:id])
    if @player.update_attributes(player_params)
---
UPDATE "players" SET "rating" = ?, "updated_at" = ? WHERE "players"."id" = ?  [["rating", 2836], ["updated_at", "2015-04-23 12:40:00.735867"], ["id", 2]]

  def edit
    @player = Player.find(params[:id])
---
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 2]]

  def destroy
    Player.find(params[:id]).destroy
---
DELETE FROM "players" WHERE "players"."id" = ?  [["id", 7]]
SELECT  "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 7]]