app/controllers/stats_controller.rb

def create
    @player = Player.find(params[:player_id])
    @stat = @player.stats.build(stat_params)
    if @stat.save
---
INSERT INTO "stats" ("level", "guild", "kills", "battlegroup", "points", "player_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

def edit
    @player = Player.find(params[:player_id])
    @stat = @player.stats.find(params[:id])
---
SELECT  "stats".* FROM "stats" WHERE "stats"."player_id" = ? AND "stats"."id" = ? LIMIT 1  [["player_id", 33], ["id", 0]]

def destroy
    @stat = Stat.find(params[:id])
    @stat.destroy
---
SELECT  "stats".* FROM "stats" WHERE "stats"."id" = ? LIMIT 1  [["id", 6]]
DELETE FROM "stats" WHERE "stats"."id" = ?  [["id", 6]]